0Bu/daikin-altherma-esp32/main/http_config.cpp
// POST config routes: /set_wifi, /set_mqtt, /set_ref_temp,
// /test_circulation, /set_circulation, /set_weather,
// /set_syslog, /set_ntp, /set_hp,
// /set_board, /set_env3, /set_ota, /set_lang, /set_diagnostics, /discover_homehub, /detect.
// Parse JSON, validate, then apply:
// WiFi/MQTT/syslog/NTP/board persist to NVS + reboot; the reference mapping persists immediately and
// applies live, while its subscriber reports missing/wrong paths only after a payload arrives;
// /set_hp persists the RX/TX pin cache (no reboot) but keeps the model session-only;
// /set_ota and /set_lang persist their UI settings and apply them live; /detect re-runs detection in
// RAM.
#include "http_handlers.hpp"
#include "checkup.hpp"
#include "state_dwell.hpp"
#include "config.hpp"
#include "env3.hpp"
#include "heap_guard.hpp"
#include "history.hpp"
#include "hp_poll.hpp"
#include "logic/config_model.hpp"
#include "logic/board_presets.hpp"
#include "logic/env3.hpp"
#include "logic/mqtt_base.hpp"  // mqtt_base_valid — the installation base topic's rules, host-tested
#include "logic/mqtt_uri.hpp"   // parse_mqtt_uri — host/port/TLS split, host-tested
#include "logic/reference_temperature.hpp"
#include "logic/weather_forecast.hpp"
#include "hp_modbus.hpp"        // mb_reconfigure — start/stop the second, independent stack
#include "mqtt_ha.hpp"          // mqtt_reference_reconfigure — apply its exact subscription live
#include "net.hpp"              // net_eth_reserved_pins — the pads a detected W5500 is clocking
#include "weather_forecast.hpp"

#include "cJSON.h"
#include "esp_http_server.h"
#include "esp_system.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "soc/soc_caps.h"   // SOC_GPIO_PIN_COUNT — per-target GPIO count for pin validation

#include "esp_crt_bundle.h"
// esp_heap_caps.h is deliberately absent: the largest-free-block sample now goes through
// heap_guard.hpp's ONE internal-DRAM sampler, so no site here spells out a capability mask.
#include "mqtt_client.h"
#include "wifi.hpp"
#include "diag_log.hpp"      // diag_printf — record when a low-heap probe is skipped
#include <sys/socket.h>
#include <netdb.h>
#include <fcntl.h>
#include <cmath>
#include <cerrno>       // errno / EINPROGRESS in the non-blocking TCP probe
#include <cstring>

namespace daik {

static void reboot_soon() { vTaskDelay(pdMS_TO_TICKS(400)); esp_restart(); }

// Every write endpoint answers a rejection as {"ok":false,"error":…} (DESIGN.md §8: a 4xx becomes an
// inline field error). Both callers — the dashboard modals and the setup portal — read `error` out of
// the JSON. `msg` is always an internal literal here (body/JSON parse failures and the fixed
// wifi_credentials_valid reasons), so it needs no escaping; never pass caller-supplied text.
static esp_err_t send_err(httpd_req_t* req, const char* status, const char* msg) {
    httpd_resp_set_status(req, status);
    return http_send_json(req, (std::string("{\"ok\":false,\"error\":\"") + msg + "\"}").c_str());
}

// A rejection carrying a stable machine `code` beside the English `error`, so the bilingual UI can
// translate it while direct API clients still receive a useful explanation. Both arguments are
// internal literals by contract — like send_err above, this does no escaping, so neither may ever
// carry caller-supplied text.
static esp_err_t send_err_code(httpd_req_t* req, const char* status,
                               const char* code, const char* msg) {
    httpd_resp_set_status(req, status);
    std::string body = "{\"ok\":false,\"code\":\"";
    body += code;
    body += "\",\"error\":\"";
    body += msg;
    body += "\"}";
    return http_send_json(req, body.c_str());
}

// ENV III reachability failures were the first users of the coded shape above; the name is kept so
// their call sites still read as what they are.
static esp_err_t send_env3_err(httpd_req_t* req, const char* status,
                               const char* code, const char* msg) {
    return send_err_code(req, status, code, msg);
}

// Shared test-before-persist gate for the standalone compatibility endpoint and the integrated
// Board Hardware form. The caller owns the one eventual config_save(), so a failed sensor probe can
// never leave board identity/peripherals saved while ENV III stayed behind (or vice versa).
static esp_err_t env3_save_preflight(httpd_req_t* req, const Config& current,
                                     Config& proposed, bool& allowed) {
    allowed = false;
    std::string reason;
    if (!env3_config_valid(proposed, reason, SOC_GPIO_PIN_COUNT - 1, hw_octal_spi(),
                           net_eth_reserved_pins())) {
        return send_err(req, "400 Bad Request", reason.c_str());
    }
    switch (env3_save_check(current, proposed)) {
        case Env3SaveCheck::None:
            allowed = true;  // disabling is the recovery path and never needs attached hardware
            return ESP_OK;
        case Env3SaveCheck::RunningSample: {
            const Env3Status status = env3_status();
            if (status.connected && status.fresh) { allowed = true; return ESP_OK; }
            return send_env3_err(req, "422 Unprocessable Entity", "env3_not_reachable",
                                 "ENV III is not currently reachable on the selected SDA/SCL pins");
        }
        case Env3SaveCheck::HardwareProbe: {
            const Env3ProbeResult direct = env3_probe(proposed.env3_sda, proposed.env3_scl);
            if (direct == Env3ProbeResult::Ok) {
                allowed = true;
                return ESP_OK;
            }
            // Probe exactly one alternative: the same two explicitly selected, board-safe GPIOs
            // with their I2C roles reversed. This is not a scan of arbitrary external pins. A save
            // becomes self-correcting only when BOTH ENV III devices prove the reversed mapping;
            // otherwise the original component-specific error remains the useful diagnosis.
            if (env3_probe_may_try_swapped(direct) &&
                env3_probe(proposed.env3_scl, proposed.env3_sda) == Env3ProbeResult::Ok) {
                const int requested_sda = proposed.env3_sda;
                proposed.env3_sda = proposed.env3_scl;
                proposed.env3_scl = requested_sda;
                diag_printf("env3: SDA/SCL were reversed; saving corrected mapping SDA=%d SCL=%d\n",
                            proposed.env3_sda, proposed.env3_scl);
                allowed = true;
                return ESP_OK;
            }
            switch (direct) {
                case Env3ProbeResult::Ok:
                    break; // handled above
                case Env3ProbeResult::BusUnavailable:
                    return send_env3_err(req, "503 Service Unavailable", "env3_probe_busy",
                                         "The I2C probe could not start; retry the save");
                case Env3ProbeResult::Sht30Unavailable:
                    return send_env3_err(req, "422 Unprocessable Entity", "env3_sht30_not_found",
                                         "ENV III temperature/humidity sensor not found on the selected pins");
                case Env3ProbeResult::Qmp6988Unavailable:
                    return send_env3_err(req, "422 Unprocessable Entity", "env3_qmp6988_not_found",
                                         "ENV III pressure sensor not found on the selected pins");
            }
            return ESP_FAIL;
        }
        case Env3SaveCheck::DisableFirst:
            return send_env3_err(req, "409 Conflict", "env3_disable_first",
                                 "Disable ENV III before changing its SDA/SCL pins");
    }
    return ESP_FAIL;
}

