0Bu/daikin-altherma-esp32/main/http_config.cpp
    if (!fixed_type_valid) return "Fixed target temperature must use at most one decimal place";
    if (!age_type_valid) return "Maximum age must be a whole number";
    if (out.topic.empty()) {                             // empty topic is the explicit Off state
        out.path.clear();
        out.setpoint_topic.clear();
        out.setpoint_path.clear();
        out.fixed_setpoint_tenths = 0;
        out.time_topic.clear();
        out.time_path.clear();
        out.enabled_path.clear();
        out.hvac_mode_path.clear();
    }
    // v16 and older API clients only send the one topic. Preserve that request contract while new
    // clients can state each exact value source independently.
    if (!out.topic.empty() && !has_setpoint_topic && !has_fixed_item && !out.setpoint_path.empty())
        out.setpoint_topic = out.topic;
    if (!out.topic.empty() && !has_time_topic && !out.time_path.empty())
        out.time_topic = out.topic;
    if (!out.topic.empty() && out.fixed_setpoint_tenths == 0 && out.setpoint_topic.empty())
        return "Target temperature needs an MQTT mapping or a fixed value";
    const char* why = nullptr;
    if (!reference_temperature_config_valid(out.name, out.topic, out.path,
                                            out.setpoint_topic, out.setpoint_path,
                                            out.fixed_setpoint_tenths,
                                            out.time_topic, out.time_path,
                                            out.enabled_path, out.hvac_mode_path,
                                            out.max_age_s, &why))
        return why ? why : "invalid reference temperature config";
    return nullptr;
}

// Decision-ready, read-only room source. Saving records user intent and applies its exact topics on
// the existing MQTT connection immediately. Payload/path/freshness errors remain runtime evidence:
// they are visible in /status and keep the write-free SHADOW diagnosis fail-closed.
static esp_err_t set_ref_temp(httpd_req_t* req) {
    RefTempRequest in;
    if (const char* error = parse_ref_temp_request(req, in))
        return send_err(req, "400 Bad Request", error);

    Config c = config();
    if (c.ref_temp_name == in.name && c.ref_temp_topic == in.topic && c.ref_temp_path == in.path &&
        c.ref_temp_setpoint_topic == in.setpoint_topic &&
        c.ref_temp_setpoint_path == in.setpoint_path && c.ref_temp_time_path == in.time_path &&
        c.ref_temp_fixed_setpoint_tenths == in.fixed_setpoint_tenths &&
        c.ref_temp_time_topic == in.time_topic &&
        c.ref_temp_enabled_path == in.enabled_path &&
        c.ref_temp_hvac_mode_path == in.hvac_mode_path &&
        c.ref_temp_max_age_s == in.max_age_s) {
        mqtt_reference_reconfigure();                 // retry the saved mapping and clear old evidence
        return http_send_json(req, "{\"ok\":true,\"saved\":false,\"reboot\":false}");
    }
    c.ref_temp_name = in.name;
    c.ref_temp_topic = in.topic;
    c.ref_temp_path = in.path;
    c.ref_temp_setpoint_topic = in.setpoint_topic;
    c.ref_temp_setpoint_path = in.setpoint_path;
    c.ref_temp_fixed_setpoint_tenths = in.fixed_setpoint_tenths;
    c.ref_temp_time_topic = in.time_topic;
    c.ref_temp_time_path = in.time_path;
    c.ref_temp_enabled_path = in.enabled_path;
    c.ref_temp_hvac_mode_path = in.hvac_mode_path;
    c.ref_temp_max_age_s = in.max_age_s;
    if (!config_save(c)) return send_err(req, "500 Internal Server Error", "config write failed");
    mqtt_reference_reconfigure();
    diag_printf("mqtt: reference temperature mapping saved%s\n", in.topic.empty() ? " (disabled)" : "");
    return http_send_json(req, "{\"ok\":true,\"saved\":true,\"reboot\":false}");
}

struct CirculationRequest {
    std::string name, topic, power_path, time_path;
    uint32_t max_age_s = CIRC_SOURCE_MAX_AGE_DEFAULT_S;
    uint16_t on_tenths_w = CIRC_SOURCE_ON_TENTHS_W_DEFAULT;
    uint16_t off_tenths_w = CIRC_SOURCE_OFF_TENTHS_W_DEFAULT;
    uint16_t confirm_s = CIRC_SOURCE_CONFIRM_DEFAULT_S;
    uint32_t test_proof = 0;
};

static bool parse_tenths_w(cJSON* root, const char* key, uint16_t fallback, uint16_t& out) {
    cJSON* item = cJSON_GetObjectItem(root, key);
    if (!item) { out = fallback; return true; }
    if (!cJSON_IsNumber(item) || !std::isfinite(item->valuedouble) ||
        item->valuedouble < 0.0 || item->valuedouble > 6553.5) return false;
    const double tenths = item->valuedouble * 10.0;
    if (std::fabs(tenths - std::round(tenths)) > 0.000001) return false;
    out = static_cast<uint16_t>(std::round(tenths));
    return true;
}

static const char* parse_circulation_request(httpd_req_t* req, CirculationRequest& out) {
    char body[1280];
    if (http_read_body(req, body, sizeof(body)) < 0) return "bad body";
    cJSON* j = cJSON_Parse(body);
    if (!j) return "bad json";
    out.name = js(j, "name");
    out.topic = js(j, "topic");
    out.power_path = js(j, "power_path");
    out.time_path = js(j, "timestamp_path");
    cJSON* age = cJSON_GetObjectItem(j, "max_age_s");
    cJSON* confirm = cJSON_GetObjectItem(j, "confirm_s");
    cJSON* proof = cJSON_GetObjectItem(j, "test_proof");
    const bool age_ok = !age || (cJSON_IsNumber(age) && age->valuedouble == age->valueint &&
                                 age->valueint >= 0);
    const bool confirm_ok = !confirm || (cJSON_IsNumber(confirm) &&
        confirm->valuedouble == confirm->valueint && confirm->valueint >= 0 &&
        confirm->valueint <= UINT16_MAX);
    const bool proof_ok = !proof || (cJSON_IsNumber(proof) && proof->valuedouble >= 0 &&
        proof->valuedouble <= 2147483647.0 && proof->valuedouble == std::floor(proof->valuedouble));
    if (age_ok && age) out.max_age_s = static_cast<uint32_t>(age->valueint);
    if (confirm_ok && confirm) out.confirm_s = static_cast<uint16_t>(confirm->valueint);
    if (proof_ok && proof) out.test_proof = static_cast<uint32_t>(proof->valuedouble);
    const bool on_ok = parse_tenths_w(j, "on_threshold_w",
                                     CIRC_SOURCE_ON_TENTHS_W_DEFAULT, out.on_tenths_w);
    const bool off_ok = parse_tenths_w(j, "off_threshold_w",
                                      CIRC_SOURCE_OFF_TENTHS_W_DEFAULT, out.off_tenths_w);
    cJSON_Delete(j);
    if (!age_ok) return "Maximum age must be a whole number";
    if (!confirm_ok) return "Confirmation time must be a whole number";
    if (!proof_ok) return "Test proof must be a whole number";
    if (!on_ok || !off_ok) return "Power thresholds must use at most one decimal place";
    if (out.topic.empty()) {
        out.power_path.clear();
        out.time_path.clear();
    }
    const char* why = nullptr;
    if (!circulation_source_config_valid(out.name, out.topic, out.power_path, out.time_path,
                                         out.max_age_s, out.on_tenths_w, out.off_tenths_w,
                                         out.confirm_s, &why))
        return why ? why : "invalid circulation source config";
    return nullptr;
}

static CirculationSourceTestConfig circulation_test_config(const CirculationRequest& in) {
    return {in.topic, in.power_path, in.time_path, in.max_age_s,
            in.on_tenths_w, in.off_tenths_w, in.confirm_s};
}

