0Bu/daikin-altherma-esp32/main/http_config.cpp
    // ENV III is an M5Stack-board feature. Switching to a Seeed or Custom board retires the optional
    // sensor in this same atomic save; its controls disappear as soon as the pending selection is no
    // longer M5Stack, so the server must make the hidden state explicit rather than retain it.
    if (c.env3_enabled && !env3_board_supported(c)) c.env3_enabled = false;

    // Checks the pins against the chip AND against the X10A link in the same snapshot, so neither
    // side can steal the other's GPIO whichever endpoint is called second (logic/config_model.hpp).
    if (!board_hw_valid(c, reason, SOC_GPIO_PIN_COUNT - 1, hw_octal_spi(),
                        net_eth_reserved_pins()))
        return send_err(req, "400 Bad Request", reason.c_str());

    bool env_allowed = false;
    const esp_err_t env_result = env3_save_preflight(req, cur, c, env_allowed);
    if (!env_allowed) return env_result;

    // Two independent questions, and answering them with ONE comparison is what made a XIAO owner's
    // save vanish (#257): picking the preset your device already carries moves no VALUE, but it is
    // still the first time anyone stated what this board is. board_save_needed/board_reboot_needed
    // (logic/config_model.hpp, host-tested) keep them apart — persist the statement, but claim no
    // reboot for it, since no driver's pin changed.
    if (!board_env_save_needed(c, cur))
        return http_send_json(req, "{\"ok\":true,\"reboot\":false}");   // nothing to write, no reboot

    if (!config_save(c)) return send_err(req, "500 Internal Server Error", "config write failed");
    // Only the statement moved: persisted, but no driver's pin changed, so no reboot. `saved` is
    // what keeps the ANSWER honest — {"reboot":false} alone makes the UI say "no changes", which
    // would report a write to NVS as nothing having happened. Additive, so the four routes that
    // never send it keep their exact contract.
    if (!board_env_reboot_needed(c, cur))
        return http_send_json(req, "{\"ok\":true,\"reboot\":false,\"saved\":true}");
    http_send_json(req, "{\"ok\":true,\"reboot\":true}");
    reboot_soon();
    return ESP_OK;
}

// POST /set_env3 {enabled,sda,scl}. The I2C driver owns the bus for the life of its task, so a pin
// change is persisted and applied by reboot just like board-local hardware. Disabled is always a
// valid recovery state. Enabling is proof-gated BEFORE config_save(): SHT30 must return a CRC-valid
// measurement and QMP6988 its chip id on the selected pair. Thus a blue Save button cannot persist
// a wiring guess and reboot into a permanently unavailable sensor.
static esp_err_t set_env3(httpd_req_t* req) {
    char body[256];
    if (http_read_body(req, body, sizeof(body)) < 0) return send_err(req, "400 Bad Request", "bad body");
    cJSON* j = cJSON_Parse(body);
    if (!j) return send_err(req, "400 Bad Request", "bad json");
    const Config cur = config();
    Config c = cur;
    c.env3_enabled = jb(j, "enabled", c.env3_enabled);
    c.env3_sda = ji(j, "sda", c.env3_sda);
    c.env3_scl = ji(j, "scl", c.env3_scl);
    cJSON_Delete(j);
    bool env_allowed = false;
    const esp_err_t env_result = env3_save_preflight(req, cur, c, env_allowed);
    if (!env_allowed) return env_result;

    if (env3_config_same(c, cur))
        return http_send_json(req, "{\"ok\":true,\"reboot\":false}");
    if (!config_save(c)) return send_err(req, "500 Internal Server Error", "config write failed");
    http_send_json(req, "{\"ok\":true,\"reboot\":true}");
    reboot_soon();
    return ESP_OK;
}

// POST /set_ota {channel:"release"|"dev"} -> validate + persist, applied LIVE (no reboot).
//
// Which published feed this device follows. Since a merge to main stopped cutting a release, there
// are two: `release` (only a manual CI workflow run tags and publishes one) and `dev` (every
// firmware-relevant merge). See logic/ota_channel.hpp.
//
// No reboot, unlike /set_board: nothing claims the channel at task start — ota_update.cpp reads it
// when it fetches, so the very next check already uses the new feed. An unknown channel name is
// REJECTED rather than defaulted: answering {"ok":true} to a typo would look like a saved setting.
static esp_err_t set_ota(httpd_req_t* req) {
    char body[128];
    if (http_read_body(req, body, sizeof(body)) < 0) return send_err(req, "400 Bad Request", "bad body");
    cJSON* j = cJSON_Parse(body);
    if (!j) return send_err(req, "400 Bad Request", "bad json");
    std::string channel = js(j, "channel");
    cJSON_Delete(j);

    if (!ota_channel_valid(channel)) return send_err(req, "400 Bad Request", "unknown channel");

    Config c = config();
    const OtaChannel want = ota_channel_parse(channel);
    if (want == c.ota_channel) return http_send_json(req, "{\"ok\":true,\"reboot\":false}");
    c.ota_channel = want;
    if (!config_save(c)) return send_err(req, "500 Internal Server Error", "config write failed");
    diag_printf("ota: update channel set to %s\n", ota_channel_name(want));
    return http_send_json(req, "{\"ok\":true,\"reboot\":false}");
}

// The web UI's manual language override. "auto" hands the choice back to the browser (the default);
// "de"/"en" force a language on every client that opens the dashboard. See logic/ui_lang.hpp.
//
// No reboot, like /set_ota: nothing claims the language at task start — the UI reads it from /status,
// so the next poll already applies it. An unknown name is REJECTED rather than defaulted: answering
// {"ok":true} to a typo would look like a saved setting.
static esp_err_t set_lang(httpd_req_t* req) {
    char body[128];
    if (http_read_body(req, body, sizeof(body)) < 0) return send_err(req, "400 Bad Request", "bad body");
    cJSON* j = cJSON_Parse(body);
    if (!j) return send_err(req, "400 Bad Request", "bad json");
    std::string lang = js(j, "lang");
    cJSON_Delete(j);

    if (!ui_lang_valid(lang)) return send_err(req, "400 Bad Request", "unknown language");

    Config c = config();
    const UiLang want = ui_lang_parse(lang);
    if (want == c.ui_lang) return http_send_json(req, "{\"ok\":true,\"reboot\":false}");
    c.ui_lang = want;
    if (!config_save(c)) return send_err(req, "500 Internal Server Error", "config write failed");
    diag_printf("ui: language set to %s\n", ui_lang_name(want));
    return http_send_json(req, "{\"ok\":true,\"reboot\":false}");
}

// Re-run auto-detection now (without waiting for a reboot): drop back to the "auto" sentinel +
// invalidate the fingerprint, so the next poll cycle sweeps protocol + re-fingerprints the unit
// (hp_poll.cpp poll_detect). Detection state is session-only, so this is a RAM-only reset.
static esp_err_t do_detect(httpd_req_t* req) {
    Config c   = config();
    c.profile  = "auto";
    c.fp_valid = false;
    config_set_runtime(c);
    checkup_reset();
    dwell_reset();
    history_reset();
    hp_poll_reconfigure();
    // The HomeHub stack is told separately, because it IS separate: this starts or stops its task
    // and re-resolves its address without touching the X10A poll engine above.
    mb_reconfigure();
    return http_send_json(req, "{\"ok\":true}");
}

