0Bu/daikin-altherma-esp32/main/http_config.cpp
void http_register_config(httpd_handle_t s, HttpSurface surface) {
    // /set_wifi is the ONE config route the open setup AP exposes (it is how you provision the
    // network); http_register_on withholds the rest there (F01) — MQTT/syslog/NTP/HP config and
    // re-detect are trusted-LAN only, so a nearby radio client cannot reconfigure the device.
    http_register_on(s, surface, "/set_wifi", HTTP_POST, set_wifi);
    http_register_on(s, surface, "/set_mqtt", HTTP_POST, set_mqtt);
    http_register_on(s, surface, "/set_ref_temp", HTTP_POST, set_ref_temp);
    http_register_on(s, surface, "/test_circulation", HTTP_POST, test_circulation);
    http_register_on(s, surface, "/set_circulation", HTTP_POST, set_circulation);
    http_register_on(s, surface, "/set_syslog", HTTP_POST, set_syslog);
    http_register_on(s, surface, "/set_ntp", HTTP_POST, set_ntp);
    http_register_on(s, surface, "/set_weather", HTTP_POST, set_weather);
    http_register_on(s, surface, "/set_hp", HTTP_POST, set_hp);
    http_register_on(s, surface, "/discover_homehub", HTTP_POST, discover_homehub_now);
    http_register_on(s, surface, "/set_board", HTTP_POST, set_board);
    http_register_on(s, surface, "/set_env3", HTTP_POST, set_env3);
    http_register_on(s, surface, "/set_ota", HTTP_POST, set_ota);
    http_register_on(s, surface, "/set_lang", HTTP_POST, set_lang);
    http_register_on(s, surface, "/set_diagnostics", HTTP_POST, set_diagnostics);
    http_register_on(s, surface, "/detect", HTTP_POST, do_detect);
}

} // namespace daik
